_posts/2024-01-26-ways-to-ignore-sections-in-org-mode.md

# Table of Contents

1.  [Ways to ignore sections in org-mode](#org2fd733f)
    1.  [Problem description](#orgb1be8ef)



<a id="org2fd733f"></a>

# TODO Ways to ignore sections in org-mode


<a id="orgb1be8ef"></a>

## Problem description

There are several ways of ignoring/not including section in org-mode
document:

1.  `noexport` tag
    Prevents exporting section (org-babel source block will be executed
    during export).

2.  `:ignore:` tag
    Section content will be included in the final document,
    however the headline will be ignored (inside the document and in toc)
    (org-babel source block will be executed during export).

3.  `:UNNUMBERED:` property:
    After adding:
    
        * Section 1                   :noexport:
        ,:PROPERTIES:
        ,:UNNUMBERED: t
        ,:END:
        
        This section will not be included in the TOC.
        
        ** Subsection 1
        Some content here.
        
        ** Subsection 2
        More content here.
    
    Now, when you generate the TOC using \`C-c C-c\` on the TOC headline
    or by running the command \`M-x org-update-statistics-cookies\`,
    "Section 1" will not be included, but the subsections will still
    appear in the TOC.

